status/2022/0819.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 07:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>13 August 2022 - 19 August 2022</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">13 August 2022 - 19 August 2022</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfb9a012">1. MIT OCW</a>
<ul>
<li><a href="#orgb60170d">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#orga84e240">1.1.1. Session 78, PS10</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org94fb254">2. Emergency Crystal Radio</a>
<ul>
<li><a href="#org043407e">2.1. Fixed switch by removing broken wafer (1 of 2)</a></li>
</ul>
</li>
<li><a href="#org495fc08">3. Mill Controller #2</a>
<ul>
<li><a href="#org4c82de1">3.1. Repurpose 'boss' hard drive</a></li>
<li><a href="#org62b8e51">3.2. Need to investigate new HW/SW for eventual replacements</a>
<ul>
<li><a href="#org8d5cea3">3.2.1. Old crap ain't gonna last forever</a></li>
<li><a href="#orge8c1431">3.2.2. Buildroot/Linux 5.15 PREEMPT + latency tools</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org016ab7f">4. Alum Rock Data Center</a>
<ul>
<li><a href="#org8d5bdc9">4.1. Using CentOS 7 for now - good until 2024?</a></li>
<li><a href="#orgb924b8e">4.2. need to check alma, rocky, others? for suitability</a></li>
</ul>
</li>
<li><a href="#org78c6e2e">5. OLPC</a>
<ul>
<li><a href="#org575f624">5.1. Needs ML1120 coin batteries to fix "invalid system date".</a></li>
</ul>
</li>
<li><a href="#org9198fd4">6. Virtual Orchestra</a>
<ul>
<li><a href="#orgaf93e86">6.1. sfz file tests</a>
<ul>
<li><a href="#org23eaaef">6.1.1. need tooling to edit sample files</a></li>
</ul>
</li>
<li><a href="#org82b78f1">6.2. increasingly skeptical whether quality results are possible</a></li>
</ul>
</li>
<li><a href="#org7556d66">7. gat</a>
<ul>
<li><a href="#orgc95f228">7.1. spectrogram done - matches 'octave' output</a></li>
</ul>
</li>
<li><a href="#org18d4ab2">8. abby</a>
<ul>
<li><a href="#org65efcce">8.1. installed three wire chassis fan - too noisy</a></li>
<li><a href="#orgbe8fc97">8.2. need to get 4 wire chassis fan</a></li>
</ul>
</li>
<li><a href="#org50d31b6">9. marble computing</a>
<ul>
<li><a href="#org075c91b">9.1. Purely mechanical linkage likely too complex for most circuits</a>
<ul>
<li><a href="#org499626e">9.1.1. Difficult to generalize</a></li>
<li><a href="#orge0dd900">9.1.2. Complexity grows with product of bits and stages</a></li>
<li><a href="#org28a69ee">9.1.3. Not sure how to 'AND' inputs efficiently</a></li>
<li><a href="#orge9b0dba">9.1.4. Tofolli -&gt; CNOT expansion increases complexity</a></li>
</ul>
</li>
<li><a href="#orgcf8e4df">9.2. Electromechanical linkage likely workable</a>
<ul>
<li><a href="#orge78fe1b">9.2.1. Easily generalizable</a></li>
<li><a href="#org2d4d9b9">9.2.2. 'Rocker' staging/sequencing allows infinite stages</a></li>
<li><a href="#org38843ba">9.2.3. Complexity grows with bits only</a></li>
<li><a href="#org56e91d0">9.2.4. RC servos for CNOT gate control relatively inexpensive</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcb4b91e">10. More project ideas</a>
<ul>
<li><a href="#orgb8a507b">10.1. Zuse Z3 simulation in Verilog</a></li>
<li><a href="#orgf9c5477">10.2. GMPForth ports to SIMH</a>
<ul>
<li><a href="#orgefb930e">10.2.1. SIMH maybe some targets (vax)</a></li>
<li><a href="#org866438c">10.2.2. MAME looks interesting for microprocessor system emulations</a></li>
<li><a href="#org9a39512">10.2.3. Ports to classic figFORTH targets</a></li>
</ul>
</li>
<li><a href="#orgaf7026f">10.3. GMPASM assembler</a></li>
<li><a href="#orgf80bca7">10.4. Extracting ISO Superboard Forth ROMS for MAME emulation</a></li>
<li><a href="#orgc861d8e">10.5. 'bwocl' OpenCL tooling</a>
<ul>
<li><a href="#orgd112a4b">10.5.1. Offline compilation</a></li>
<li><a href="#orgfd3d8d2">10.5.2. Standard Kernel Running</a></li>
</ul>
</li>
<li><a href="#org3a3b6c9">10.6. hardware support for classic 5V CPUs</a>
<ul>
<li><a href="#org1bfba24">10.6.1. RTX2000, CDP1802 still in production!</a></li>
<li><a href="#org54cb2fb">10.6.2. 6502, 68000, 320C30, others on hand</a></li>
<li><a href="#org820abeb">10.6.3. CPUs with async bus may be supportable without RAM</a></li>
<li><a href="#org4fc1fa7">10.6.4. Use Nucleo w/ 5V tolerant IO as boot loader controller</a></li>
</ul>
</li>
<li><a href="#org0b3d474">10.7. Existing 'retro' hardware still working?</a>
<ul>
<li><a href="#orge46202b">10.7.1. OSI Superboard</a></li>
<li><a href="#org1a70d2d">10.7.2. Super Jolt</a></li>
<li><a href="#org487d358">10.7.3. Ampro Little Board</a></li>
<li><a href="#org837a29c">10.7.4. Etc.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2e5af4e">11. David Davies</a>
<ul>
<li><a href="#org7b86069">11.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#org30ee3a4">11.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#orgf5477b3">11.3. Next hearing 9/6/2022</a></li>
</ul>
</li>
<li><a href="#org4eb9159">12. Peter Kim</a>
<ul>
<li><a href="#org079a978">12.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#org185a0a9">12.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#org331395c">12.3. Change of Plea Hearing Held 5/10/2022 (Guilty on various counts)</a></li>
<li><a href="#orgace86af">12.4. Sentencing 9/20/2022</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgfb9a012" class="outline-2">
<h2 id="orgfb9a012"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgb60170d" class="outline-3">
<h3 id="orgb60170d"><span class="section-number-3">1.1.</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orga84e240" class="outline-4">
<h4 id="orga84e240"><span class="section-number-4">1.1.1.</span> Session 78, PS10</h4>
</div>
</div>
</div>
<div id="outline-container-org94fb254" class="outline-2">
<h2 id="org94fb254"><span class="section-number-2">2.</span> Emergency Crystal Radio</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org043407e" class="outline-3">
<h3 id="org043407e"><span class="section-number-3">2.1.</span> Fixed switch by removing broken wafer (1 of 2)</h3>
</div>
</div>
<div id="outline-container-org495fc08" class="outline-2">
<h2 id="org495fc08"><span class="section-number-2">3.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org4c82de1" class="outline-3">
<h3 id="org4c82de1"><span class="section-number-3">3.1.</span> Repurpose 'boss' hard drive</h3>
</div>
<div id="outline-container-org62b8e51" class="outline-3">
<h3 id="org62b8e51"><span class="section-number-3">3.2.</span> Need to investigate new HW/SW for eventual replacements</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org8d5cea3" class="outline-4">
<h4 id="org8d5cea3"><span class="section-number-4">3.2.1.</span> Old crap ain't gonna last forever</h4>
</div>
<div id="outline-container-orge8c1431" class="outline-4">
<h4 id="orge8c1431"><span class="section-number-4">3.2.2.</span> Buildroot/Linux 5.15 PREEMPT + latency tools</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
First pass done - boots on real hardware
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org016ab7f" class="outline-2">
<h2 id="org016ab7f"><span class="section-number-2">4.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org8d5bdc9" class="outline-3">
<h3 id="org8d5bdc9"><span class="section-number-3">4.1.</span> Using CentOS 7 for now - good until 2024?</h3>
</div>
<div id="outline-container-orgb924b8e" class="outline-3">
<h3 id="orgb924b8e"><span class="section-number-3">4.2.</span> need to check alma, rocky, others? for suitability</h3>
</div>
</div>
<div id="outline-container-org78c6e2e" class="outline-2">
<h2 id="org78c6e2e"><span class="section-number-2">5.</span> OLPC</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org575f624" class="outline-3">
<h3 id="org575f624"><span class="section-number-3">5.1.</span> Needs ML1120 coin batteries to fix "invalid system date".</h3>
</div>
</div>
<div id="outline-container-org9198fd4" class="outline-2">
<h2 id="org9198fd4"><span class="section-number-2">6.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgaf93e86" class="outline-3">
<h3 id="orgaf93e86"><span class="section-number-3">6.1.</span> sfz file tests</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org23eaaef" class="outline-4">
<h4 id="org23eaaef"><span class="section-number-4">6.1.1.</span> need tooling to edit sample files</h4>
</div>
</div>
<div id="outline-container-org82b78f1" class="outline-3">
<h3 id="org82b78f1"><span class="section-number-3">6.2.</span> increasingly skeptical whether quality results are possible</h3>
</div>
</div>
<div id="outline-container-org7556d66" class="outline-2">
<h2 id="org7556d66"><span class="section-number-2">7.</span> gat</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgc95f228" class="outline-3">
<h3 id="orgc95f228"><span class="section-number-3">7.1.</span> spectrogram done - matches 'octave' output</h3>
</div>
</div>
<div id="outline-container-org18d4ab2" class="outline-2">
<h2 id="org18d4ab2"><span class="section-number-2">8.</span> abby</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org65efcce" class="outline-3">
<h3 id="org65efcce"><span class="section-number-3">8.1.</span> installed three wire chassis fan - too noisy</h3>
</div>
<div id="outline-container-orgbe8fc97" class="outline-3">
<h3 id="orgbe8fc97"><span class="section-number-3">8.2.</span> need to get 4 wire chassis fan</h3>
</div>
</div>
<div id="outline-container-org50d31b6" class="outline-2">
<h2 id="org50d31b6"><span class="section-number-2">9.</span> marble computing</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org075c91b" class="outline-3">
<h3 id="org075c91b"><span class="section-number-3">9.1.</span> Purely mechanical linkage likely too complex for most circuits</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-org499626e" class="outline-4">
<h4 id="org499626e"><span class="section-number-4">9.1.1.</span> Difficult to generalize</h4>
</div>
<div id="outline-container-orge0dd900" class="outline-4">
<h4 id="orge0dd900"><span class="section-number-4">9.1.2.</span> Complexity grows with product of bits and stages</h4>
</div>
<div id="outline-container-org28a69ee" class="outline-4">
<h4 id="org28a69ee"><span class="section-number-4">9.1.3.</span> Not sure how to 'AND' inputs efficiently</h4>
</div>
<div id="outline-container-orge9b0dba" class="outline-4">
<h4 id="orge9b0dba"><span class="section-number-4">9.1.4.</span> Tofolli -&gt; CNOT expansion increases complexity</h4>
</div>
</div>
<div id="outline-container-orgcf8e4df" class="outline-3">
<h3 id="orgcf8e4df"><span class="section-number-3">9.2.</span> Electromechanical linkage likely workable</h3>
<div class="outline-text-3" id="text-9-2">
</div>
<div id="outline-container-orge78fe1b" class="outline-4">
<h4 id="orge78fe1b"><span class="section-number-4">9.2.1.</span> Easily generalizable</h4>
</div>
<div id="outline-container-org2d4d9b9" class="outline-4">
<h4 id="org2d4d9b9"><span class="section-number-4">9.2.2.</span> 'Rocker' staging/sequencing allows infinite stages</h4>
</div>
<div id="outline-container-org38843ba" class="outline-4">
<h4 id="org38843ba"><span class="section-number-4">9.2.3.</span> Complexity grows with bits only</h4>
</div>
<div id="outline-container-org56e91d0" class="outline-4">
<h4 id="org56e91d0"><span class="section-number-4">9.2.4.</span> RC servos for CNOT gate control relatively inexpensive</h4>
</div>
</div>
</div>
<div id="outline-container-orgcb4b91e" class="outline-2">
<h2 id="orgcb4b91e"><span class="section-number-2">10.</span> More project ideas</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orgb8a507b" class="outline-3">
<h3 id="orgb8a507b"><span class="section-number-3">10.1.</span> Zuse Z3 simulation in Verilog</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Good excuse for floating point ALU design.
</p>
</div>
</div>
<div id="outline-container-orgf9c5477" class="outline-3">
<h3 id="orgf9c5477"><span class="section-number-3">10.2.</span> GMPForth ports to SIMH</h3>
<div class="outline-text-3" id="text-10-2">
</div>
<div id="outline-container-orgefb930e" class="outline-4">
<h4 id="orgefb930e"><span class="section-number-4">10.2.1.</span> SIMH maybe some targets (vax)</h4>
</div>
<div id="outline-container-org866438c" class="outline-4">
<h4 id="org866438c"><span class="section-number-4">10.2.2.</span> MAME looks interesting for microprocessor system emulations</h4>
<div class="outline-text-4" id="text-10-2-2">
<p>
How to support erzatz systems?
</p>
</div>
</div>
<div id="outline-container-org9a39512" class="outline-4">
<h4 id="org9a39512"><span class="section-number-4">10.2.3.</span> Ports to classic figFORTH targets</h4>
</div>
</div>
<div id="outline-container-orgaf7026f" class="outline-3">
<h3 id="orgaf7026f"><span class="section-number-3">10.3.</span> GMPASM assembler</h3>
<div class="outline-text-3" id="text-10-3">
<p>
May be useful for handbuilt and rare systems (DMX1000?).
</p>
</div>
</div>
<div id="outline-container-orgf80bca7" class="outline-3">
<h3 id="orgf80bca7"><span class="section-number-3">10.4.</span> Extracting ISO Superboard Forth ROMS for MAME emulation</h3>
</div>
<div id="outline-container-orgc861d8e" class="outline-3">
<h3 id="orgc861d8e"><span class="section-number-3">10.5.</span> 'bwocl' OpenCL tooling</h3>
<div class="outline-text-3" id="text-10-5">
</div>
<div id="outline-container-orgd112a4b" class="outline-4">
<h4 id="orgd112a4b"><span class="section-number-4">10.5.1.</span> Offline compilation</h4>
</div>
<div id="outline-container-orgfd3d8d2" class="outline-4">
<h4 id="orgfd3d8d2"><span class="section-number-4">10.5.2.</span> Standard Kernel Running</h4>
</div>
</div>
<div id="outline-container-org3a3b6c9" class="outline-3">
<h3 id="org3a3b6c9"><span class="section-number-3">10.6.</span> hardware support for classic 5V CPUs</h3>
<div class="outline-text-3" id="text-10-6">
</div>
<div id="outline-container-org1bfba24" class="outline-4">
<h4 id="org1bfba24"><span class="section-number-4">10.6.1.</span> RTX2000, CDP1802 still in production!</h4>
</div>
<div id="outline-container-org54cb2fb" class="outline-4">
<h4 id="org54cb2fb"><span class="section-number-4">10.6.2.</span> 6502, 68000, 320C30, others on hand</h4>
</div>
<div id="outline-container-org820abeb" class="outline-4">
<h4 id="org820abeb"><span class="section-number-4">10.6.3.</span> CPUs with async bus may be supportable without RAM</h4>
</div>
<div id="outline-container-org4fc1fa7" class="outline-4">
<h4 id="org4fc1fa7"><span class="section-number-4">10.6.4.</span> Use Nucleo w/ 5V tolerant IO as boot loader controller</h4>
</div>
</div>
<div id="outline-container-org0b3d474" class="outline-3">
<h3 id="org0b3d474"><span class="section-number-3">10.7.</span> Existing 'retro' hardware still working?</h3>
<div class="outline-text-3" id="text-10-7">
</div>
<div id="outline-container-orge46202b" class="outline-4">
<h4 id="orge46202b"><span class="section-number-4">10.7.1.</span> OSI Superboard</h4>
</div>
<div id="outline-container-org1a70d2d" class="outline-4">
<h4 id="org1a70d2d"><span class="section-number-4">10.7.2.</span> Super Jolt</h4>
</div>
<div id="outline-container-org487d358" class="outline-4">
<h4 id="org487d358"><span class="section-number-4">10.7.3.</span> Ampro Little Board</h4>
</div>
<div id="outline-container-org837a29c" class="outline-4">
<h4 id="org837a29c"><span class="section-number-4">10.7.4.</span> Etc.</h4>
</div>
</div>
</div>
<div id="outline-container-org2e5af4e" class="outline-2">
<h2 id="org2e5af4e"><span class="section-number-2">11.</span> David Davies</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org7b86069" class="outline-3">
<h3 id="org7b86069"><span class="section-number-3">11.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-org30ee3a4" class="outline-3">
<h3 id="org30ee3a4"><span class="section-number-3">11.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-orgf5477b3" class="outline-3">
<h3 id="orgf5477b3"><span class="section-number-3">11.3.</span> Next hearing 9/6/2022</h3>
</div>
</div>
<div id="outline-container-org4eb9159" class="outline-2">
<h2 id="org4eb9159"><span class="section-number-2">12.</span> Peter Kim</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org079a978" class="outline-3">
<h3 id="org079a978"><span class="section-number-3">12.1.</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-org185a0a9" class="outline-3">
<h3 id="org185a0a9"><span class="section-number-3">12.2.</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-org331395c" class="outline-3">
<h3 id="org331395c"><span class="section-number-3">12.3.</span> Change of Plea Hearing Held 5/10/2022 (Guilty on various counts)</h3>
</div>
<div id="outline-container-orgace86af" class="outline-3">
<h3 id="orgace86af"><span class="section-number-3">12.4.</span> Sentencing 9/20/2022</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-01-28 Sat 07:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
